main-files/adcrypto-web/adcrypto-web-v1.4.0/app/Http/Controllers/User/Auth/LoginController.php

    protected function authenticated(Request $request, $user)
    {
        // Check if email verification is required and user is not verified
        $basic_settings = BasicSettingsProvider::get();
        if ($basic_settings->email_verification == true && $user->email_verified != 1) {
            if ($request->has('verification_code')) {
                $verification_code = $request->verification_code;
                $verification_data = \App\Models\UserAuthorization::where('user_id', $user->id)->where('code', $verification_code)->first();
                if ($verification_data) {
                    $user->email_verified = 1;
                    $user->save();
                    $verification_data->delete();
---
select * from `user_authorizations` where `user_id` = 5 and `code` = '246861' limit 1
update `users` set `email_verified` = 1, `users`.`updated_at` = '2025-09-07 23:22:04' where `id` = 5
delete from `user_authorizations` where `id` = 22

                    // Store in database and send email
                    \DB::beginTransaction();
                    try{
                        \App\Models\UserAuthorization::where("user_id",$user->id)->delete();
                        \DB::table("user_authorizations")->insert($data);
---
delete from `user_authorizations` where `user_id` = 5
insert into `user_authorizations` (`user_id`, `code`, `token`, `created_at`) values (5, '246861', 'YyjMHVkamZFJyhoKCO1DRKpPVDomo3F1FfXOfiYT2d', '2025-09-07 23:21:31')