main-files/adcrypto-web/adcrypto-web-v1.4.0/app/Http/Controllers/User/Auth/RegisterController.php

select exists(select * from `users` where `username` = 'killmax') as `exists`
---
    public function register(Request $request)
    {
        $validated = $this->validator($request->all())->validate();
        $basic_settings             = $this->basic_settings;

        $validated = Arr::except($validated,['agree']);
        $validated['email_verified']    = ($basic_settings->email_verification == true) ? false : true;
        $validated['sms_verified']      = ($basic_settings->sms_verification == true) ? false : true;
        $validated['kyc_verified']      = ($basic_settings->kyc_verification == true) ? false : true;
        $validated['password']          = Hash::make($validated['password']);
        $validated['username']          = make_username($validated['firstname'],$validated['lastname']);

        if(User::where("username",$validated['username'])->exists()) {

insert into `users` (`firstname`, `lastname`, `email`, `password`, `email_verified`, `sms_verified`, `kyc_verified`, `username`, `updated_at`, `created_at`) values ('kill', 'max', 'killmax523@gmail.com', '$2y$10$zGND2TykIiwpr.3avBBbmOCkmbT6/pvEdBR4ZhgwjKi2mCbZSzMna', 0, 1, 0, 'killmax', '2025-09-07 23:13:45', '2025-09-07 23:13:45')
---
    protected function create(array $data)
    {
        return User::create($data);

delete from `user_authorizations` where `user_id` = 4
insert into `user_authorizations` (`user_id`, `code`, `token`, `created_at`) values (4, '828513', 'uhzUpDe1emM9yAFXBsCDSiPfnYpGEHQHvey74mKG4W', '2025-09-07 23:13:45')
---
    protected function registered(Request $request, $user)
    {
        try{
            // Check if email verification is required
            if ($this->basic_settings->email_verification == true) {
                // Log the user out since they need to verify email first
                $this->guard()->logout();

                // Generate new verification code and send email
                try {
                    // Generate verification data
                    $data = [
                        'user_id'       => $user->id,
                        'code'          => generate_random_code(),
                        'token'         => generate_unique_string("user_authorizations","token",200),
                        'created_at'    => now(),
                    ];

                    // Store in database and send email
                    \DB::beginTransaction();
                    try{
                        \App\Models\UserAuthorization::where("user_id",$user->id)->delete();
                        \DB::table("user_authorizations")->insert($data);