main-files/adcrypto-web/adcrypto-web-v1.4.0/app/Http/Helpers/helpers.php

select * from `admin_notifications` where `admin_id` != 1 and `type` in ('SIDE_NAV')
---
function get_admin_notifications()
{
    $admin = auth()->user();
    $notification_clear_at =   $admin->notification_clear_at;
    if ($notification_clear_at  == null) {
        $notifications = AdminNotification::notAuth()->getByType([NotificationConst::SIDE_NAV])->get();

delete from `user_authorizations` where `user_id` = 1
insert into `user_authorizations` (`user_id`, `code`, `token`, `created_at`) values (1, '135483', 'hZjxrFwvBqyMv4gulGN3vUlGdkFxiMkrxpOkoiRgsW', '2025-07-21 18:37:25')
---
function mailVerificationTemplate($user) {
    $data = [
        'user_id'       => $user->id,
        'code'          => generate_random_code(),
        'token'         => generate_unique_string("user_authorizations","token",200),
        'created_at'    => now(),
    ];



    DB::beginTransaction();
    try{
        UserAuthorization::where("user_id",$user->id)->delete();
        DB::table("user_authorizations")->insert($data);

select * from `user_notifications` where `user_id` = 5 order by `created_at` desc limit 10
---
function get_user_notifications(){
    $notifications  = UserNotification::auth()->latest()->take(10)->get();

update `users` set `two_factor_secret` = 'XKNQPG26PMJMDKZU', `users`.`updated_at` = '2025-09-07 23:22:13' where `id` = 5
---
function generate_google_2fa_auth_qr() {
    $google2FA = new \PragmaRX\Google2FA\Google2FA();
    $secret_key = $google2FA->generateSecretKey();
    $user = auth()->user();
    if($user->two_factor_secret) {
        $site_url = App::make('url')->to('/');
        $generate_text = $google2FA->getQRCodeUrl($site_url,$user->username,$user->two_factor_secret);
    }else {
        $site_url = App::make('url')->to('/');
        $generate_text = $google2FA->getQRCodeUrl($site_url,$user->username,$secret_key);
        $user->update([
            'two_factor_secret' => $secret_key,
        ]);