main-files/adcrypto-web/adcrypto-web-v1.4.0/app/Http/Helpers/PaymentGateway.php

select * from `temporary_datas` where `identifier` = '4d2e57ca-43c4-4417-9a02-73135ba05a66' limit 1
select * from `payment_gateway_currencies` where `payment_gateway_currencies`.`payment_gateway_id` in (1) order by `id` desc
select * from `currencies` where `currencies`.`id` in (1)
select * from `user_wallets` where `id` = 5 limit 1
---
    public function gateway() {
        $request_data = $this->request_data;

        if(empty($request_data)) throw new Exception("Gateway Information is not available. Please provide payment gateway currency alias");
        $validated = $this->validator($request_data)->validate();
        $temporary_data     = TemporaryData::where('identifier',$validated['identifier'])->first();
        $gateway_currency   = PaymentGatewayCurrency::with(['gateway'])->where("alias",$temporary_data->data->payment_method->alias)->first();
        $wallet_currency   = UserWallet::with(['currency'])->where('id',$temporary_data->data->wallet->wallet_id)->first();

select * from `temporary_datas` where `identifier` = '4d2e57ca-43c4-4417-9a02-73135ba05a66' limit 1
select * from `user_wallets` where `user_id` = 5 and `id` = 5 limit 1
---
    public function chargeCalculate($currency,$receiver_currency = null) {
        $temporary_data     = TemporaryData::where('identifier',$this->request_data['identifier'])->first();

        if($this->predefined_user_wallet) {
            $user_wallet = $this->predefined_user_wallet;
        }else{
            $user_wallet    =  UserWallet::auth()->where("id",$temporary_data->data->wallet->wallet_id)->first();