main-files/adcrypto-web/adcrypto-web-v1.4.0/app/Models/User.php

    public function getLastLoginAttribute() {
        if($this->loginLogs()->count() > 0) {
            return $this->loginLogs()->get()->last()->created_at->format("H:i A, d M Y");
---
select count(*) as aggregate from `user_login_logs` where `user_login_logs`.`user_id` = 5 and `user_login_logs`.`user_id` is not null
select * from `user_login_logs` where `user_login_logs`.`user_id` = 5 and `user_login_logs`.`user_id` is not null