main-files/adcrypto-web/adcrypto-web-v1.4.0/app/Traits/User/LoggedInUsers.php

insert into `user_wallets` (`balance`, `created_at`, `currency_id`, `public_address`, `status`, `user_id`) values (0, '2025-09-07 23:22:04', 1, 'eO889bGakEajljOvEqdRPrTaYS6987KwRfNW2TuOTH', 1, 5), (0, '2025-09-07 23:22:04', 2, 'vAd8T7eaB4WFK6kgN5kYvoGMV93J6CQKmBSg9qaDSc', 1, 5), (0, '2025-09-07 23:22:04', 3, 'n5XStdjf1kWmC3T4cGmPdtnwXCskrn66YKcDJtn3Y8', 1, 5), (0, '2025-09-07 23:22:04', 4, '9Te2dTNbHcjHPZFSKpmilsjA2hljokAEJwtgxJeTlz', 1, 5)
---
    protected function refreshUserWallets($user) {
        $user_wallets = $user->wallets->pluck("currency_id")->toArray();
        $currencies = Currency::active()->roleHasOne()->pluck("id")->toArray();


        $new_currencies = array_diff($currencies,$user_wallets);


        $new_wallets = [];
        foreach($new_currencies as $item) {
            $public_address = generate_unique_string("user_wallets","public_address",42);

            $new_wallets[] = [
                'user_id'           => $user->id,
                'currency_id'       => $item,
                'public_address'    => $public_address,
                'balance'           => 0,
                'status'            => true,
                'created_at'        => now(),
            ];
        }

        try{
            UserWallet::insert($new_wallets);

insert into `user_login_logs` (`user_id`, `ip`, `mac`, `city`, `country`, `longitude`, `latitude`, `timezone`, `browser`, `os`, `updated_at`, `created_at`) values (5, '127.0.0.1', '', 'New Haven', 'United States', -72.92, 41.31, 'America/New_York', 'Chrome', 'Windows', '2025-09-07 23:22:04', '2025-09-07 23:22:04')
---
    protected function createLoginLog($user) {
        $client_ip = request()->ip() ?? false;
        $location = geoip()->getLocation($client_ip);

        $agent = new Agent();

        $mac = "";

        $data = [
            'user_id'       => $user->id,
            'ip'            => $client_ip,
            'mac'           => $mac,
            'city'          => $location['city'] ?? "",
            'country'       => $location['country'] ?? "",
            'longitude'     => $location['lon'] ?? "",
            'latitude'      => $location['lat'] ?? "",
            'timezone'      => $location['timezone'] ?? "",
            'browser'       => $agent->browser() ?? "",
            'os'            => $agent->platform() ?? "",
        ];

        try{
            UserLoginLog::create($data);