main-files/adcrypto-web/adcrypto-web-v1.4.0/app/Traits/User/RegisteredUsers.php

insert into `user_wallets` (`balance`, `created_at`, `currency_id`, `public_address`, `status`, `user_id`) values (0, '2025-07-21 18:36:52', 1, 'GOa4JDN5A5flYb9yvuOKd1xAADbFmjgZ3vXNEsKOYY', 1, 1), (0, '2025-07-21 18:36:52', 2, 'SfCMySmMrE2mEvgACVM89iik4rz7NKh2hlD4vhtAvz', 1, 1), (0, '2025-07-21 18:36:52', 3, 'O4nNWUu1fdoEPSUHJvQ94VOwhmdnSUO42TOUWgrcGJ', 1, 1), (0, '2025-07-21 18:36:52', 4, '2ubgbcJKP2rPppraS7SsNF4lSZHSqbVMNd6puMvVQl', 1, 1)
---
    protected function createUserWallets($user) {
        $currencies = Currency::active()->roleHasOne()->pluck("id")->toArray();
        $wallets = [];
        foreach($currencies as $currency_id) {
            $public_address = generate_unique_string("user_wallets","public_address",42);
            $wallets[] = [
                'user_id'       => $user->id,
                'currency_id'   => $currency_id,
                'public_address'    => $public_address,
                'balance'       => 0,
                'status'        => true,
                'created_at'    => now(),
            ];
        }

        try{
            UserWallet::insert($wallets);