main-files/adcrypto-web/adcrypto-web-v1.4.0/app/Http/Controllers/Admin/BuyCryptoLogController.php

    public function pending(){
        $page_title     = "Pending Buy Crypto Logs";
        $transactions   = Transaction::where('type',PaymentGatewayConst::BUY_CRYPTO)->orderBy('id','desc')->where('status',global_const()::STATUS_PENDING)->get();
---
select * from `transactions` where `type` = 'Buy Crypto' and `status` = 1 order by `id` desc