main-files/adcrypto-web/adcrypto-web-v1.4.0/app/Http/Controllers/Admin/CurrencyController.php

select * from `currencies` order by `default` desc limit 10 offset 0
select count(*) as aggregate from `currencies`
select * from `networks` where `status` = 1 order by `id` desc
---
    public function index()
    {
        $page_title = "Setup Currency";
        $currencies = Currency::orderByDesc('default')->paginate(10);
        $networks   = Network::where('status',true)->orderByDesc('id')->get();

select * from `currencies` where `code` = 'USDT' limit 1
---
    public function update(Request $request)
    {
        $target = $request->target ?? $request->currency_code;
        $currency = Currency::where('code',$target)->first();

delete from `currency_has_networks` where `id` in (5, 6)
update `currencies` set `rate` = '109001', `currencies`.`updated_at` = '2025-06-04 21:26:51' where `id` = 3
---
        $validated = replace_array_key($validated,"currency_");
        try{
            $currency_network_id    = $currency->networks->pluck('id');
            CurrencyHasNetwork::whereIn('id',$currency_network_id)->delete();

            $currency->update($validated);

insert into `currency_has_networks` (`created_at`, `currency_id`, `network_id`) values ('2025-06-04 21:26:51', 3, '5'), ('2025-06-04 21:26:51', 3, '4')
---

                $collection = collect($networks);
                $uniqueNetwork = $collection->unique('network_id')->values()->all();
                CurrencyHasNetwork::insert($uniqueNetwork);