main-files/adcrypto-web/adcrypto-web-v1.4.0/app/Http/Controllers/Admin/DashboardController.php

    public function index()
    {
        $page_title      = "Dashboard";

        $last_month_start   = date('Y-m-01', strtotime('-1 month', strtotime(date('Y-m-d'))));
        $last_month_end     = date('Y-m-31', strtotime('-1 month', strtotime(date('Y-m-d'))));
        $this_month_start   = date('Y-m-01');
        $this_month_end     = date('Y-m-d');

        $total_users     = (User::toBase()->count() == 0) ? 1 : User::toBase()->count();
        $unverified_user = User::toBase()->where('email_verified',0)->count();
        $active_user     = User::toBase()->where('status',true)->count();
        $banned_user     = User::toBase()->where('status',false)->count();
        $user_percent    = (($active_user * 100 ) / $total_users);
        $user_chart      = [$active_user, $banned_user,$unverified_user,$total_users];

        if ($user_percent > 100) {
            $user_percent = 100;
        }

        $total_ticket       = (SupportTicket::toBase()->count() == 0) ? 1 : SupportTicket::toBase()->count();
        $active_ticket      = SupportTicket::toBase()->where('status',SupportTicketConst::ACTIVE)->count();
        $pending_ticket     = SupportTicket::toBase()->where('status',SupportTicketConst::PENDING)->count();
---
select count(*) as aggregate from `users`
select count(*) as aggregate from `users` where `email_verified` = 0
select count(*) as aggregate from `users` where `status` = 1
select count(*) as aggregate from `users` where `status` = 0
select count(*) as aggregate from `support_tickets`
select count(*) as aggregate from `support_tickets` where `status` = 2
select count(*) as aggregate from `support_tickets` where `status` = 3

            $percent_ticket = ($active_ticket / ($active_ticket + $pending_ticket)) * 100;
        }

        $total_categories           = (BlogCategory::toBase()->count() == 0) ? 1 : BlogCategory::toBase()->count();
        $active_category            = BlogCategory::toBase()->where('status',true)->count();
        $inactive_category          = BlogCategory::toBase()->where('status',false)->count();
---
select count(*) as aggregate from `blog_categories`
select count(*) as aggregate from `blog_categories` where `status` = 1
select count(*) as aggregate from `blog_categories` where `status` = 0

            $category_percent = 100;
        }

        $total_blogs           = (Blog::toBase()->count() == 0) ? 1 : Blog::toBase()->count();
        $active_blog            = Blog::toBase()->where('status',true)->count();
        $inactive_blog          = Blog::toBase()->where('status',false)->count();
---
select count(*) as aggregate from `blogs`
select count(*) as aggregate from `blogs` where `status` = 1
select count(*) as aggregate from `blogs` where `status` = 0

            $blog_percent = 100;
        }

        $total_transactions           = (Transaction::toBase()->count() == 0) ? 1 : Transaction::toBase()->count();
        $pending_transactions         = Transaction::toBase()->where('status',global_const()::STATUS_PENDING)->count();
        $confirm_transactions         = Transaction::toBase()->where('status',global_const()::STATUS_CONFIRM_PAYMENT)->count();
---
select count(*) as aggregate from `transactions`
select count(*) as aggregate from `transactions` where `status` = 1
select count(*) as aggregate from `transactions` where `status` = 2

            $percent_transactions = 100;
        }

        $total_buy_crypto   = (Transaction::where('type',PaymentGatewayConst::BUY_CRYPTO)->toBase()->count() == 0) ? 1 : Transaction::where('type',PaymentGatewayConst::BUY_CRYPTO)->toBase()->count();
        $pending_buy_crypto         = Transaction::where('type',PaymentGatewayConst::BUY_CRYPTO)->toBase()->where('status',global_const()::STATUS_PENDING)->count();
        $confirm_buy_crypto         = Transaction::where('type',PaymentGatewayConst::BUY_CRYPTO)->toBase()->where('status',global_const()::STATUS_CONFIRM_PAYMENT)->count();
---
select count(*) as aggregate from `transactions` where `type` = 'Buy Crypto'
select count(*) as aggregate from `transactions` where `type` = 'Buy Crypto' and `status` = 1
select count(*) as aggregate from `transactions` where `type` = 'Buy Crypto' and `status` = 2

            $percent_buy_crypto = 100;
        }

        $total_charges      = Transaction::toBase()->sum('total_charge');
        $this_month_charge  = Transaction::toBase()->whereDate('created_at',">=" , $this_month_start)
                            ->whereDate('created_at',"<=" , $this_month_end)
                            ->sum('total_charge');

        $last_month_charge = Transaction::toBase()->whereDate('created_at',">=" , $last_month_start)
                            ->whereDate('created_at',"<=" , $last_month_end)
                            ->sum('total_charge');

        $monthlyDataBuy    = Transaction::where("type",PaymentGatewayConst::BUY_CRYPTO)->select(
            DB::raw('YEAR(created_at) as year'),
            DB::raw('MONTH(created_at) as month'),
            DB::raw('COUNT(*) as total')
        )
        ->groupBy('year', 'month')
        ->orderBy('year', 'asc')
        ->orderBy('month', 'asc')
        ->get();

        $monthlyDataSell    = Transaction::where("type",PaymentGatewayConst::SELL_CRYPTO)->select(
            DB::raw('YEAR(created_at) as year'),
            DB::raw('MONTH(created_at) as month'),
            DB::raw('COUNT(*) as total')
        )
        ->groupBy('year', 'month')
        ->orderBy('year', 'asc')
        ->orderBy('month', 'asc')
        ->get();

        $monthlyDataWithdraw    = Transaction::where("type",PaymentGatewayConst::WITHDRAW_CRYPTO)->select(
            DB::raw('YEAR(created_at) as year'),
            DB::raw('MONTH(created_at) as month'),
            DB::raw('COUNT(*) as total')
        )
        ->groupBy('year', 'month')
        ->orderBy('year', 'asc')
        ->orderBy('month', 'asc')
        ->get();

        $monthlyDataExchange    = Transaction::where("type",PaymentGatewayConst::EXCHANGE_CRYPTO)->select(
            DB::raw('YEAR(created_at) as year'),
            DB::raw('MONTH(created_at) as month'),
            DB::raw('COUNT(*) as total')
        )
        ->groupBy('year', 'month')
        ->orderBy('year', 'asc')
        ->orderBy('month', 'asc')
        ->get();
---
select sum(`total_charge`) as aggregate from `transactions`
select sum(`total_charge`) as aggregate from `transactions` where date(`created_at`) >= '2025-07-01' and date(`created_at`) <= '2025-07-21'
select sum(`total_charge`) as aggregate from `transactions` where date(`created_at`) >= '2025-06-01' and date(`created_at`) <= '2025-06-31'
select YEAR(created_at) as year, MONTH(created_at) as month, COUNT(*) as total from `transactions` where `type` = 'Buy Crypto' group by `year`, `month` order by `year` asc, `month` asc
select YEAR(created_at) as year, MONTH(created_at) as month, COUNT(*) as total from `transactions` where `type` = 'Sell Crypto' group by `year`, `month` order by `year` asc, `month` asc
select YEAR(created_at) as year, MONTH(created_at) as month, COUNT(*) as total from `transactions` where `type` = 'Withdraw Crypto' group by `year`, `month` order by `year` asc, `month` asc
select YEAR(created_at) as year, MONTH(created_at) as month, COUNT(*) as total from `transactions` where `type` = 'Exchange Crypto' group by `year`, `month` order by `year` asc, `month` asc

            $exchange_data[]    = $count;
        }

        $transactions   = Transaction::with(['currency'])->where("type",PaymentGatewayConst::BUY_CRYPTO)
                            ->orderBy('id','desc')->latest()->take(3)->get();
        $data                               = [
            'unverified_user'               => $unverified_user,
            'active_user'                   => $active_user,
            'user_percent'                  => $user_percent,
            'total_user_count'              => User::all()->count(),
            'user_chart_data'               => $user_chart,

            'active_ticket'                 => $active_ticket,
            'pending_ticket'                => $pending_ticket,
            'percent_ticket'                => $percent_ticket,
            'total_ticket_count'            => SupportTicket::all()->count(),

            'active_category'               => $active_category,
            'inactive_category'             => $inactive_category,
            'category_percent'              => $category_percent,
            'total_category_count'          => BlogCategory::all()->count(),

            'active_blog'                   => $active_blog,
            'inactive_blog'                 => $inactive_blog,
            'blog_percent'                  => $blog_percent,
            'total_blog_count'              => Blog::all()->count(),

---
select * from `transactions` where `type` = 'Buy Crypto' order by `id` desc, `created_at` desc limit 3
select * from `blog_categories`
select * from `support_tickets`
select * from `users`

            'pending_buy_crypto'            => $pending_buy_crypto,
            'confirm_buy_crypto'            => $confirm_buy_crypto,
            'percent_buy_crypto'            => $percent_buy_crypto,
            'total_buy_crypto_count'        => Transaction::where("type",PaymentGatewayConst::BUY_CRYPTO)->get()->count(),
---
select * from `transactions` where `type` = 'Buy Crypto'