main-files/adcrypto-web/adcrypto-web-v1.4.0/app/Http/Controllers/Admin/LanguageController.php

select * from `languages` limit 10 offset 0
select count(*) as aggregate from `languages`
---
    public function index()
    {
        $page_title = "Language Manager";
        $languages = Language::paginate(10);

select exists(select * from `languages` where not `id` = '1' and `status` = 1) as `exists`
select * from `languages` where `languages`.`id` = '1' limit 1
update `languages` set `status` = 0, `languages`.`updated_at` = '2025-06-04 21:24:15' where `id` = 1
---
    public function statusUpdate(Request $request) {
        $validator = Validator::make($request->all(),[
            'data_target'       => 'required|numeric|exists:languages,id',
            'status'            => 'required|boolean',
        ]);

        if($validator->fails()) {
            $errors = ['error' => $validator->errors() ];
            return Response::error($errors);
        }

        $validated = $validator->validate();

        if(Language::whereNot("id",$validated['data_target'])->default()->exists()) {
            $warning = ['warning' => ['Please deselect your default language first.']];
            return Response::warning($warning);
        }

        $language = Language::find($validated['data_target']);

        try{
            $language->update([
                'status'        => ($validated['status']) ? false : true,
            ]);