main-files/adcrypto-web/adcrypto-web-v1.4.0/app/Http/Controllers/Admin/UserCareController.php

select * from `users` where `username` = 'kaijumen' limit 1
select * from `currencies` where `currencies`.`id` in (1, 2, 3, 4)
select * from `user_wallets` where `user_id` = 5
select count(*) as aggregate from `transactions` where `user_id` = 5
select count(*) as aggregate from `transactions` where `user_id` = 5 and `status` = 1
select count(*) as aggregate from `transactions` where `user_id` = 5 and `status` = 2
select count(*) as aggregate from `support_tickets` where `status` = 2
select count(*) as aggregate from `support_tickets` where (`status` = 3 or `status` = 0)
select count(*) as aggregate from `support_tickets` where `status` = 1
---
    public function userDetails($username)
    {
        $page_title             = "User Details";
        $user                   = User::where('username', $username)->first();
        if(!$user) return back()->with(['error' => ['Opps! User not exists']]);
        $user_wallet            = UserWallet::with(['currency'])->where('user_id',$user->id)->get();
        $transactions           = Transaction::where('user_id',$user->id)->count();
        $pending_transactions   = Transaction::where('user_id',$user->id)
                                    ->where('status',global_const()::STATUS_PENDING)->count();
        $confirm_transactions   = Transaction::where('user_id',$user->id)
                                    ->where('status',global_const()::STATUS_CONFIRM_PAYMENT)->count();
        if($transactions == 0){
            $percent_transactions   = 0;
        }else{
            $percent_transactions   = ((($pending_transactions + $confirm_transactions) * 100) / $transactions);
        }


        if($percent_transactions > 100){
            $percent_transactions = 100;
        }

        $active_support_ticket = SupportTicket::active()->count();
        $pending_support_ticket = SupportTicket::pending()->count();
        $solved_support_ticket = SupportTicket::solved()->count();

select * from `users` where `username` = 'kaijumen' limit 1
update `users` set `address` = '{\"country\":\"\",\"state\":\"\",\"city\":\"\",\"zip\":\"\",\"address\":\"\"}', `kyc_verified` = '1', `users`.`updated_at` = '2025-09-07 23:26:55' where `id` = 5
---
            $validated['full_mobile']   = remove_speacial_char($validated['mobile']);
        }

        $user = User::where('username', $username)->first();
        if(!$user) return back()->with(['error' => ['Opps! User not exists']]);

        try {
            $user->update($validated);