main-files/adcrypto-web/adcrypto-web-v1.4.0/app/Models/Admin/Currency.php

select * from `currency_has_networks` where `currency_id` = 1
select * from `networks` where `networks`.`id` in (4, 5)
select * from `networks` order by `id` desc
---
    public function getEditDataAttribute() {
        $role = "";
        if($this->sender == true && $this->receiver == true) {
            $role = "both";
        }else if($this->sender == true && $this->receiver == false) {
            $role = "sender";
        }else if($this->receiver == true && $this->sender == false) {
            $role = "receiver";
        }
        $networks       = CurrencyHasNetwork::with(['network'])->where('currency_id',$this->id)->get();
        $all_networks   = Network::orderByDesc('id')->get();