main-files/adcrypto-web/adcrypto-web-v1.4.0/app/Http/Controllers/User/BuyCryptoController.php

select * from `currencies` where `status` = 1 order by `id` asc
select * from `currencies` where `status` = 1 limit 1
select * from `payment_gateway_currencies` where exists (select * from `payment_gateways` where `payment_gateway_currencies`.`payment_gateway_id` = `payment_gateways`.`id` and `slug` = 'payment-method' and `status` = 1)
---
    public function index(){
        $page_title         = "- Buy Crypto";
        $currencies         = Currency::with(['networks'])->where('status',true)->orderBy('id')->get();
        $first_currency     = Currency::where('status',true)->first();
        $payment_gateway    = PaymentGatewayCurrency::whereHas('gateway', function ($gateway) {
            $gateway->where('slug', PaymentGatewayConst::payment_method_slug());
            $gateway->where('status', 1);
        })->get();

select * from `currencies` where `currencies`.`id` = '1' limit 1
select * from `networks` where `networks`.`id` in (4, 5)
---
    public function getCurrencyNetworks(Request $request){
        $validator    = Validator::make($request->all(),[
            'currency'  => 'required|integer',
        ]);
        if($validator->fails()) {
            return Response::error($validator->errors()->all());
        }

        $currency  = Currency::with(['networks' => function($network) {
            $network->with(['network']);
        }])->find($request->currency);

select * from `networks` where `id` = '5' limit 1
select * from `currency_has_networks` where `currency_id` = 1 and `network_id` = 5 limit 1
select * from `currencies` where `currencies`.`id` = 1 limit 1
select * from `payment_gateway_currencies` where `payment_gateway_currencies`.`payment_gateway_id` in (1) order by `id` desc
---
    public function store(Request $request){
        if($request->wallet_type == global_const()::INSIDE_WALLET){
            $validator  = Validator::make($request->all(),[
                'sender_currency'   => 'required',
                'network'           => 'required',
                'amount'            => 'required',
                'payment_method'    => 'required'
            ]);
            if($validator->fails()){
                return back()->withErrors($validator)->withInput($request->all());
            }
            $validated          = $validator->validate();
            $wallet_currency    = $validated['sender_currency'];
            $amount             = $validated['amount'];

            $user_wallet  = UserWallet::auth()->whereHas("currency",function($q) use ($wallet_currency) {
                $q->where("id",$wallet_currency)->active();
            })->active()->first();


            if(!$user_wallet){
                return back()->with(['error' => ['Wallet not found!']]);
            }

            $network        = Network::where('id',$validated['network'])->first();
            $network_info   = CurrencyHasNetwork::where('currency_id',$user_wallet->currency->id)->where('network_id',$network->id)->first();

            $payment_gateway_currency   = PaymentGatewayCurrency::with(['gateway'])->where('id',$validated['payment_method'])->first();

select * from `temporary_datas` where `identifier` = '4d2e57ca-43c4-4417-9a02-73135ba05a66' limit 1
---
    public function preview($identifier){
        $page_title     = "- Buy Crypto Preview";
        $data           = TemporaryData::where('identifier',$identifier)->first();