main-files/adcrypto-web/adcrypto-web-v1.4.0/app/Http/Controllers/User/DashboardController.php

select * from `currencies` where `currencies`.`id` in (1, 2, 3, 4)
select * from `user_wallets` where `user_id` = 5
select YEAR(created_at) as year, MONTH(created_at) as month, COUNT(*) as total from `transactions` where `user_id` = 5 and `type` = 'Buy Crypto' group by `year`, `month` order by `year` asc, `month` asc
select YEAR(created_at) as year, MONTH(created_at) as month, COUNT(*) as total from `transactions` where `user_id` = 5 and `type` = 'Sell Crypto' group by `year`, `month` order by `year` asc, `month` asc
select YEAR(created_at) as year, MONTH(created_at) as month, COUNT(*) as total from `transactions` where `user_id` = 5 and `type` = 'Withdraw Crypto' group by `year`, `month` order by `year` asc, `month` asc
---
    public function index()
    {
        $page_title     = "- Dashboard";
        $wallets           = UserWallet::auth()->with(['currency'])->get();
        $monthlyDataBuy    = Transaction::auth()->where("type",PaymentGatewayConst::BUY_CRYPTO)->select(
            DB::raw('YEAR(created_at) as year'),
            DB::raw('MONTH(created_at) as month'),
            DB::raw('COUNT(*) as total')
        )
        ->groupBy('year', 'month')
        ->orderBy('year', 'asc')
        ->orderBy('month', 'asc')
        ->get();

        $monthlyDataSell    = Transaction::auth()->where("type",PaymentGatewayConst::SELL_CRYPTO)->select(
            DB::raw('YEAR(created_at) as year'),
            DB::raw('MONTH(created_at) as month'),
            DB::raw('COUNT(*) as total')
        )
        ->groupBy('year', 'month')
        ->orderBy('year', 'asc')
        ->orderBy('month', 'asc')
        ->get();

        $monthlyDataWithdraw    = Transaction::auth()->where("type",PaymentGatewayConst::WITHDRAW_CRYPTO)->select(
            DB::raw('YEAR(created_at) as year'),
            DB::raw('MONTH(created_at) as month'),
            DB::raw('COUNT(*) as total')
        )
        ->groupBy('year', 'month')
        ->orderBy('year', 'asc')
        ->orderBy('month', 'asc')
        ->get();

select * from `transactions` where `user_id` = 5 and `type` = 'Buy Crypto' order by `id` desc, `created_at` desc limit 3
---
            $withdraw_data[]    = $count;
        }

        $transactions   = Transaction::auth()->where("type",PaymentGatewayConst::BUY_CRYPTO)
        ->orderBy('id','desc')->latest()->take(3)->get();