main-files/adcrypto-web/adcrypto-web-v1.4.0/app/Http/Controllers/Admin/Auth/LoginController.php

insert into `admin_login_logs` (`admin_id`, `ip`, `mac`, `city`, `country`, `longitude`, `latitude`, `timezone`, `browser`, `os`, `updated_at`, `created_at`) values (1, '127.0.0.1', '', 'New Haven', 'United States', -72.92, 41.31, 'America/New_York', 'Edge', 'Windows', '2025-06-04 21:22:56', '2025-06-04 21:22:56')
insert into `admin_notifications` (`type`, `admin_id`, `message`, `updated_at`, `created_at`) values ('SIDE_NAV', 1, '{\"title\":\"Super Admin(superadmin) logged in.\",\"time\":\"1 second ago\",\"image\":\"http:\/\/adcrypto.test\/main-files\/adcrypto-web\/adcrypto-web-v1.4.0\/public\/backend\/images\/default\/default.webp\"}', '2025-06-04 21:22:56', '2025-06-04 21:22:56')
---
    protected function createLoginLog($admin) {

        $client_ip = request()->ip() ?? false;
        $location = geoip()->getLocation($client_ip);

        $agent = new Agent();

        $mac = "";

        $data = [
            'admin_id'      => $admin->id,
            'ip'            => $client_ip,
            'mac'           => $mac,
            'city'          => $location['city'] ?? "",
            'country'       => $location['country'] ?? "",
            'longitude'     => $location['lon'] ?? "",
            'latitude'      => $location['lat'] ?? "",
            'timezone'      => $location['timezone'] ?? "",
            'browser'       => $agent->browser() ?? "",
            'os'            => $agent->platform() ?? "",
        ];

        try{
            AdminLoginLogs::create($data);
            $notification_message = [
                'title'   => $admin->fullname . "(" . $admin->username . ")" . " logged in.",
                'time'      => Carbon::now()->diffForHumans(),
                'image'     => get_image($admin->image,'admin-profile'),
            ];
            AdminNotification::create([
                'type'      => NotificationConst::SIDE_NAV,
                'admin_id'  => $admin->id,
                'message'   => $notification_message,
            ]);

update `admins` set `last_logged_in` = '2025-06-04 21:23:02', `login_status` = 1, `admins`.`updated_at` = '2025-06-04 21:23:02' where `id` = 1
---
    protected function updateInfo($admin) {
        try{
            $admin->update([
                'last_logged_in'    => now(),
                'login_status'      => true,
            ]);